Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dak169.h
extern volatile __GLCDCLUT138bits_t GLCDCLUT138bits __asm__ ("GLCDCLUT138") __attribute__((section("sfrs"), address(0xBF8EA628)));
#define GLCDCLUT139 GLCDCLUT139
extern volatile uint32_t   GLCDCLUT139 __attribute__((section("sfrs"), address(0xBF8EA62C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT139bits_t;
extern volatile __GLCDCLUT139bits_t GLCDCLUT139bits __asm__ ("GLCDCLUT139") __attribute__((section("sfrs"), address(0xBF8EA62C)));
#define GLCDCLUT140 GLCDCLUT140
extern volatile uint32_t   GLCDCLUT140 __attribute__((section("sfrs"), address(0xBF8EA630)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT140bits_t;
extern volatile __GLCDCLUT140bits_t GLCDCLUT140bits __asm__ ("GLCDCLUT140") __attribute__((section("sfrs"), address(0xBF8EA630)));
#define GLCDCLUT141 GLCDCLUT141
extern volatile uint32_t   GLCDCLUT141 __attribute__((section("sfrs"), address(0xBF8EA634)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT141bits_t;
extern volatile __GLCDCLUT141bits_t GLCDCLUT141bits __asm__ ("GLCDCLUT141") __attribute__((section("sfrs"), address(0xBF8EA634)));
#define GLCDCLUT142 GLCDCLUT142
extern volatile uint32_t   GLCDCLUT142 __attribute__((section("sfrs"), address(0xBF8EA638)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT142bits_t;
extern volatile __GLCDCLUT142bits_t GLCDCLUT142bits __asm__ ("GLCDCLUT142") __attribute__((section("sfrs"), address(0xBF8EA638)));
#define GLCDCLUT143 GLCDCLUT143
extern volatile uint32_t   GLCDCLUT143 __attribute__((section("sfrs"), address(0xBF8EA63C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT143bits_t;
extern volatile __GLCDCLUT143bits_t GLCDCLUT143bits __asm__ ("GLCDCLUT143") __attribute__((section("sfrs"), address(0xBF8EA63C)));
#define GLCDCLUT144 GLCDCLUT144
extern volatile uint32_t   GLCDCLUT144 __attribute__((section("sfrs"), address(0xBF8EA640)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT144bits_t;
extern volatile __GLCDCLUT144bits_t GLCDCLUT144bits __asm__ ("GLCDCLUT144") __attribute__((section("sfrs"), address(0xBF8EA640)));
#define GLCDCLUT145 GLCDCLUT145
extern volatile uint32_t   GLCDCLUT145 __attribute__((section("sfrs"), address(0xBF8EA644)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT145bits_t;
extern volatile __GLCDCLUT145bits_t GLCDCLUT145bits __asm__ ("GLCDCLUT145") __attribute__((section("sfrs"), address(0xBF8EA644)));
#define GLCDCLUT146 GLCDCLUT146
extern volatile uint32_t   GLCDCLUT146 __attribute__((section("sfrs"), address(0xBF8EA648)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT146bits_t;
extern volatile __GLCDCLUT146bits_t GLCDCLUT146bits __asm__ ("GLCDCLUT146") __attribute__((section("sfrs"), address(0xBF8EA648)));
#define GLCDCLUT147 GLCDCLUT147
extern volatile uint32_t   GLCDCLUT147 __attribute__((section("sfrs"), address(0xBF8EA64C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT147bits_t;
extern volatile __GLCDCLUT147bits_t GLCDCLUT147bits __asm__ ("GLCDCLUT147") __attribute__((section("sfrs"), address(0xBF8EA64C)));
#define GLCDCLUT148 GLCDCLUT148
extern volatile uint32_t   GLCDCLUT148 __attribute__((section("sfrs"), address(0xBF8EA650)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT148bits_t;
extern volatile __GLCDCLUT148bits_t GLCDCLUT148bits __asm__ ("GLCDCLUT148") __attribute__((section("sfrs"), address(0xBF8EA650)));
#define GLCDCLUT149 GLCDCLUT149
extern volatile uint32_t   GLCDCLUT149 __attribute__((section("sfrs"), address(0xBF8EA654)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT149bits_t;
extern volatile __GLCDCLUT149bits_t GLCDCLUT149bits __asm__ ("GLCDCLUT149") __attribute__((section("sfrs"), address(0xBF8EA654)));
#define GLCDCLUT150 GLCDCLUT150
extern volatile uint32_t   GLCDCLUT150 __attribute__((section("sfrs"), address(0xBF8EA658)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT150bits_t;
extern volatile __GLCDCLUT150bits_t GLCDCLUT150bits __asm__ ("GLCDCLUT150") __attribute__((section("sfrs"), address(0xBF8EA658)));
#define GLCDCLUT151 GLCDCLUT151
extern volatile uint32_t   GLCDCLUT151 __attribute__((section("sfrs"), address(0xBF8EA65C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT151bits_t;
extern volatile __GLCDCLUT151bits_t GLCDCLUT151bits __asm__ ("GLCDCLUT151") __attribute__((section("sfrs"), address(0xBF8EA65C)));
#define GLCDCLUT152 GLCDCLUT152
extern volatile uint32_t   GLCDCLUT152 __attribute__((section("sfrs"), address(0xBF8EA660)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT152bits_t;
extern volatile __GLCDCLUT152bits_t GLCDCLUT152bits __asm__ ("GLCDCLUT152") __attribute__((section("sfrs"), address(0xBF8EA660)));
#define GLCDCLUT153 GLCDCLUT153
extern volatile uint32_t   GLCDCLUT153 __attribute__((section("sfrs"), address(0xBF8EA664)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT153bits_t;
extern volatile __GLCDCLUT153bits_t GLCDCLUT153bits __asm__ ("GLCDCLUT153") __attribute__((section("sfrs"), address(0xBF8EA664)));
#define GLCDCLUT154 GLCDCLUT154
extern volatile uint32_t   GLCDCLUT154 __attribute__((section("sfrs"), address(0xBF8EA668)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT154bits_t;
extern volatile __GLCDCLUT154bits_t GLCDCLUT154bits __asm__ ("GLCDCLUT154") __attribute__((section("sfrs"), address(0xBF8EA668)));
#define GLCDCLUT155 GLCDCLUT155
extern volatile uint32_t   GLCDCLUT155 __attribute__((section("sfrs"), address(0xBF8EA66C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT155bits_t;
extern volatile __GLCDCLUT155bits_t GLCDCLUT155bits __asm__ ("GLCDCLUT155") __attribute__((section("sfrs"), address(0xBF8EA66C)));
#define GLCDCLUT156 GLCDCLUT156
extern volatile uint32_t   GLCDCLUT156 __attribute__((section("sfrs"), address(0xBF8EA670)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT156bits_t;
extern volatile __GLCDCLUT156bits_t GLCDCLUT156bits __asm__ ("GLCDCLUT156") __attribute__((section("sfrs"), address(0xBF8EA670)));
#define GLCDCLUT157 GLCDCLUT157
extern volatile uint32_t   GLCDCLUT157 __attribute__((section("sfrs"), address(0xBF8EA674)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT157bits_t;
extern volatile __GLCDCLUT157bits_t GLCDCLUT157bits __asm__ ("GLCDCLUT157") __attribute__((section("sfrs"), address(0xBF8EA674)));
#define GLCDCLUT158 GLCDCLUT158
extern volatile uint32_t   GLCDCLUT158 __attribute__((section("sfrs"), address(0xBF8EA678)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT158bits_t;
